"""task 1
Написати програму, яка вміє переводити температуру з C в Фаренгейти і Кельвіни Наприклад: дана температура в Цельсіях 25 С
Фаренгейт: 45.9F - вважається за формулою C * 9/5 + 32
Кельвіни: 298.16K - вважається за формулою C + 273.15
Користувач вводить температуру в градусах Цельсіях, програма выводить температуру в Фаренгейтах та Кельвінах
task 2
Змішано V1 літрів води з температурою T1 та V2 літрів з температурою T2. Написати програму, яка порахує об'єм і температуру суміші, що вийшла. Обчислюється за формулою (v1 * *t1 + v2 ** t2) / (v1 + v2)
Всі параметри виводяться в консолі, вивести обʼєм та температуру
task 3
Написать калькулятор с основными операциями(+, -, *, /)
Користувач вводить два числа та арифметичну операцію
Також можна додати перевірку для всіх задач з негативним сценарієм"""


print('-----'*30)
name_of_program = int(input(
    'Виберіть тип програми який хочете використати  1 - Конвертація температури у - F/K, 2 - Розрахунок обʼєму та температури після змішування, 3 - калькулятор\n'))
result = None
if name_of_program == 1:
    print('Конвертація температури в цельсіях в температуру в Форенгейтах або в Кельвінах\n')
    
    type_of_temperature = int(input(
        'Введіть  - "1" якщо хочете конвертувати температуру в форенгейти або введіть - "2" якщо хочете конвертувати температуру в Кельвіни \n'))
    temperature = float(input('Введіть температуру в °С\n'))
    if type_of_temperature == 1:
        result = temperature * 9/5 + 32
        print(f'Температура = {result}°F')
    elif type_of_temperature == 2:
        result = temperature + 273.15
        print(f'Температура = {result}K')
    else:
        print(f'Ви обрали не корректний тип конвертації. Результат дорівнє {result}')

elif name_of_program == 2:
    print('Розрахунок обʼєму та температури суміши після змішуванная\n')
    V1 = float(input("Введіть об'єм першої частини води (л): \n"))
    T1 = float(input("Введіть температуру першої частини води (°C): \n"))
    V2 = float(input("Введіть об'єм другої частини води (л): \n"))
    T2 = float(input("Введіть температуру другої частини води (°C): \n"))
    V_mix = V1 + V2
    T_mix = (V1 * T1 + V2 * T2) / V_mix
    print(f"Об'єм суміші: {V_mix} л")
    print(f"Температура суміші: {T_mix:.3f} °C")

elif name_of_program == 3:
    print('Калькулятор')
    typе_of_operation = input("Введіть тип операції - (+, -, *, /) \n")
    number_1 = int(input('Введіть перше число\n'))
    number_2 = int(input('Введіть друге число\n'))
    if  typе_of_operation == '+':
        result = number_1+number_2
    elif typе_of_operation == '-':
        result = number_1+number_2
    elif typе_of_operation == '*':
        result = number_1*number_2
    elif typе_of_operation == '/':
        result = number_1/number_2
    else: 
        print('Ви ввели некоректний тип операції')
    print(f'Результат обчислення дорівнює - {result}')
else:
    print('Ви обрали некоректний тип програми')
