"""Користувач вводить слово, якщо це слово є поліндромом, вивести '+', інакше '-'
Користувач вводить текст і слово, яке потрібно знайти, якщо це слово є в тексті, вивести 'YES', інакше 'NO'
Написати валідатор для пошти. Користувач вводить пошту, а програма повинна перевірити, що в пошті є символ '@' і '.', і якщо це так, вивести "YES", інакше "NO"
Користувач вводить текст через пробіл. Конвертувати текст у список. Вивести останні 3 елементи зі списку, якщо список містить менше 3-х елементів, вивести повідомлення про 
те що кількість елементів менша за 3 і вказати кількість елементів поточного списку
(*) - за бажанням
Додати перевірку введеної IP-адреси. Адреса вважається коректно заданою, якщо вона:
складається з 4 чисел (а не літер чи інших символів)
числа розділені точкою
кожне число в діапазоні від 0 до 255 Якщо адреса неправильна, виводьте повідомлення: «Неправильна IP-адреса». Повідомлення "Неправильна IP-адреса" має виводитися лише один раз, 
навіть якщо кілька пунктів вище не виконані.
Обмеження: завдання треба виконувати, використовуючи лише пройдені теми.
Мене додати в ревьювери пул-реквеста odynokyi.r@gmail.com
(перед ти додати мене в Settings -> Collaborators)
"""


print('-----'*30)
name_of_program = int(input(
    'Виберіть тип програми який хочете використати  1 - Перевірка чи є слово поліндром, 2 - Перевірка чи є слово в тексті, 3 - Валідатор до пошти, 4 - Конвертація текста у список, 5 - Валідатор до IP address\n'))
result = None
if name_of_program == 1:
    print('Перевірка чи є слово поліндром\n')
    word = input('Введіть слово: ')
    if word == word[::-1]:
        print("+")
    else:
        print("-")
elif name_of_program == 2:
    print('Перевірка чи є слово в тексті\n')
    text = input('Введіть текст: ')
    word = input('Введіть слово: ')
    if word in text:
        print ("Yes")
    else:
        print("No")
elif name_of_program == 3:
    print('Валідатор до пошти\n')
    email = input('Введіть пошту: ')
    if '@' in email and '.' in email:
        print ("YES")
    else:
        print("NO")            
elif name_of_program == 4:
    text = input('Введіть текст через пробіл: ')
    list_of_words = text.split()
    if len(list_of_words)<3:
        print(f'Кількість елементів списку меньше 3 і дорінвнює {len(list_of_words)}')
    else:
        print(list_of_words[-3:])
elif name_of_program == 5:
    ip = input('Введіть ip address: ')
    octets = ip.split('.')
    if len(octets)!=4:
        print("Неправильна IP-адресса")
    elif not octets[0].isdigit() or not octets[1].isdigit() or not octets[2].isdigit() or not octets[3].isdigit():
        print("Неправильна IP-адресса")
    elif int(octets[0])<0 or int(octets[0])>255 or int(octets[1])<0 or int(octets[1])>255 or int(octets[2])<0 or int(octets[2])>255 or int(octets[3])<0 or int(octets[3])>255:
        print("Неправильна IP-адресса")
    else:
        print("Правильна IP-адресса")
else:
    print("Ви обрали не корректний тип програми")

    
    